
//武器種基本情報
var buki_base = {
"刀": [
	//耐久	攻撃 防御
	[1560,	75,	65], //lv0
	[12072,	1715,	1585], //lv1000
	9,  //気
	150, //範囲
	[19, 22], //攻撃フレーム数, 攻撃後の隙フレーム数
	2  //最大同時攻撃数
	],
"槍": [
	[1140,	51,	48],
	[8820,	1267,	1192],
	5,
	200,
	[23, 30], //攻撃フレーム数, 攻撃後の隙フレーム数
	Number.MAX_VALUE  //最大同時攻撃数
	],
"槌": [
	[1780,	90,	77],
	[15540,	2194,	1742],
	12,
	100,
	[27, 30], //攻撃フレーム数, 攻撃後の隙フレーム数
	Number.MAX_VALUE  //最大同時攻撃数
	],
"盾": [
	[1800,	61,	90],
	[15800,	1501,	1890],
	11,
	90,
	[24, 30], //攻撃フレーム数, 攻撃後の隙フレーム数
	2  //最大同時攻撃数
	],
"拳": [
	[1900,	48,	40],
	[16900,	1168,	1240],
	8,
	90,
	[32, 19], //攻撃フレーム数, 攻撃後の隙フレーム数
	2  //最大同時攻撃数
	],
"投剣": [
	[1200,	60,	42],
	[9601,	1020,	1046],
	9,
	220,
	[24, 18], //攻撃フレーム数, 攻撃後の隙フレーム数
	2  //最大同時攻撃数
	],
"弓": [
	[960,	50,	39],
	[7432,	1234,	959],
	7,
	280,
	[19, 18, 37], //攻撃フレーム数, 攻撃後の隙フレーム数、2回攻撃時攻撃フレーム
	1  //最大同時攻撃数
	],
"石弓": [
	[1220,	72,	50],
	[9460,	1776,	1242],
	9,
	250,
	[24, 24], //攻撃フレーム数, 攻撃後の隙フレーム数
	1  //最大同時攻撃数
	],
"鉄砲": [
	[840,	90,	36],
	[6505,	2226,	892],
	12,
	340,
	[36.8, 30], //攻撃フレーム数, 攻撃後の隙フレーム数
	1  //最大同時攻撃数
	],
"大砲": [
	[870,	69,	39],
	[6734,	1701,	959],
	14,
	340,
	[42, 45], //攻撃フレーム数, 攻撃後の隙フレーム数
	Number.MAX_VALUE  //最大同時攻撃数
	],
"歌舞": [
	[900,	42,	37],
	[6972,	1037,	933],
	10,
	300,
	[62, 60, 92], //攻撃フレーム数, 攻撃後の隙フレーム数、2回攻撃時フレーム
	Number.MAX_VALUE  //最大同時攻撃数
	],
"法術": [
	[960,	48,	34],
	[7432,	1192,	858],
	10,
	240,
	[42, 30], //攻撃フレーム数, 攻撃後の隙フレーム数
	1  //最大同時攻撃数
	],
"鈴": [
	[1000,	45,	36],
	[8000,	1197,	932],
	10,
	320,
	[156, 1], //攻撃フレーム数, 攻撃後の隙フレーム数
	Number.MAX_VALUE  //最大同時攻撃数
	],
"杖": [
	[850,	90,	34],
	[6350,	2194,	858],
	11,
	240,
	[37, 30], //攻撃フレーム数, 攻撃後の隙フレーム数
	1  //最大同時攻撃数
	],
"祓串": [
	[930,	40,	35],
	[7202,	1000,	883],
	9,
	260,
	[32, 30, 47], //攻撃フレーム数, 攻撃後の隙フレーム数, 2回攻撃時フレーム
	1  //最大同時攻撃数
	],
"トークン": [
	[2000,	100,	100],
	[2000,	100,	100],
	0,
	100,
	[60, 60], //攻撃フレーム数, 攻撃後の隙フレーム数
	1  //最大同時攻撃数
	],

};



//計略、特技、武器等のバフ情報
var Buff = function(buff){

	//引数の値を本オブジェクトに反映
	Object.assign(this, buff); 

}

Buff.prototype = {
	type : 0, //0=自身, r=範囲, a=全体, 近接=全ての近接(投剣含む), 遠隔=全ての遠隔, 範囲遠隔=範囲内の遠隔, 範囲外=範囲外, dz=同属性

	hp_p : 0, //耐久割合上昇
	hp_f : 0, //耐久固定値上昇

	atk_p : 0, //攻撃割合上昇
	atk_f : 0, //攻撃固定値上昇

	def_p : 0, //防御割合上昇
	def_f : 0, //防御固定値上昇

	range_p : 0, //範囲割合上昇
	range_f : 0, //範囲固定値上昇

	spd_p : 0, //攻撃速度割合上昇
	spd_f : 0, //攻撃速度値上昇(なし)

	wait_p : 0, //攻撃後の隙割合上昇
	wait_f : 0, //攻撃後の隙値上昇(なし)

	rec_p : 0, //回復の割合上昇
	rec_f : 0, //回復の値上昇

	dis_p : 0, //防御無視割合
	dis_f : 0, //防御無視固定(なし)

	dmg_p : 0, //与ダメージ割合増加
	dmg_f : 0, //与ダメージ固定値増加(なし)

	bomatk_p : 0, //砲撃直撃時の攻撃ボーナス
	ki_p : 0,  //巨大化消費気軽減
	para_f : 0,  //最大同時攻撃数上昇

	hdmg_p: 0, //被ダメージ軽減
	yrec_p: 0, //与ダメージ回復
	fly_atk_p : 0, //飛行兜への攻撃増加
	cont_f: 0, //追加の連続攻撃数
	cont_p: 0, //追加の連続攻撃数
	blarng_p: 0, //爆風範囲の割合拡大
	bladmg_p: 0, //爆風範囲の割大ダメージ上昇
	trkdmg_p: 0, //計略ダメージ割合上昇

	//敵へのデバフ
	d_hp_p : 0, //耐久割合減少
	d_hp_f : 0, //耐久固定値減少

	d_atk_p : 0, //攻撃割合減少
	d_atk_f : 0, //攻撃固定値減少

	d_def_p : 0, //防御割合減少
	d_def_f : 0, //防御固定値減少

	d_range_p : 0, //範囲割合減少
	d_range_f : 0, //範囲固定値減少

	d_spd_p : 0, //攻撃速度割合減少
	d_spd_f : 0, //攻撃速度値減少(なし)

	d_wait_p : 0, //攻撃後の隙割合減少
	d_wait_f : 0, //攻撃後の隙値減少(なし)

	d_move_p : 0, //移動速度割合減少
	d_move_f : 0, //移動速度固定値減少

	d_dmg_p : 0, //被ダメージ割合増加
	d_dmg_f : 0, //被ダメージ固定値増加(なし)

	d_ydmg_p : 0, //与ダメージ割合低下
	d_ydmg_f : 0 //与ダメージ固定値低下(なし)
};


//数値が0のプロパティを削除した新たなバフを返却。
function Buff_Shrink(buff) {
	var ret = {};
	Object.getOwnPropertyNames(buff).forEach(function(prop){
		if(buff[prop] != 0) {
			ret[prop] = buff[prop];
		}
	});
	return ret;
}

function Buff_Print(buff) {
	var str = [];
	function BP(buff, name, minus) {
		minus = minus || "";
		var ret = "";
		if(buff[name + "_p"] != 0){ ret += minus + buff[name + "_p"] + "%"; }
		if(buff[name + "_f"] != 0){ ret += ((minus != "")?minus:"+") + buff[name + "_f"]; }
		if(ret == "") { ret = "0%"; }
		return ret;
	}
	if(buff.atk_p != 0 || buff.atk_f != 0) str.push("攻撃" + BP(buff, "atk"));
	if(buff.spd_p != 0 ) str.push("攻撃速度" + BP(buff, "spd"));
	if(buff.wait_p != 0) str.push("隙減少" + BP(buff, "wait"));
	if(buff.dmg_p != 0) str.push("与ダメ" + BP(buff, "dmg"));
	if(buff.d_dmg_p != 0 ) str.push("被ダメ" + BP(buff, "d_dmg"));
	if(buff.d_def_p != 0 || buff.d_def_f != 0) str.push("敵防御" + BP(buff, "d_def", "-"));
	if(buff.dis_p != 0) str.push("防御無視" + BP(buff, "dis"));
	if(buff.range_p != 0 || buff.range_f != 0) str.push("範囲" + BP(buff, "range"));
	if(buff.bomatk_p != 0){ str.push("直撃ボーナス+" + buff.bomatk_p + "%"); }
	if(buff.para_f != 0){ str.push("同時攻撃数+" + buff.para_f); }
	return str.join(", ");
}

//buff1からbuff2を引いた新たなバフを返却する
function Buff_Minus(buff1, buff2) {
	var ret = {};
	for(var prop in buff1){
		if(buff1[prop] != buff2[prop]) {
			ret[prop] = buff1[prop] - buff2[prop];
		}
	};
	return ret;
}
//DPSに影響するもののみ抽出
function Buff_MinusDPS(buff1, buff2) {
	var buff = Buff_Minus(buff1, buff2);
	var ret = {};
	var list = [
		"atk_p", "atk_f",
		"spd_p","spd_f",
		"wait_p","wait_f",
		"dmg_p","dmg_f",
		"d_dmg_p","d_dmg_f",
		"d_def_p","d_def_f",
		"range_p","range_f"
	];

	for(var prop in buff) {
		if(list.includes(prop)){
			ret[prop] = buff[prop];
		}
	}
	return ret;
}

function Buff_create(skillBuff) {
	var buffs = [];
	if(Array.isArray(skillBuff)) {
		for(var i = 0; i < skillBuff.length; i++) {
			buffs.push(new Buff(skillBuff[i]));
		}
	} else {
		buffs.push(new Buff(skillBuff || {}));
	}
	return buffs;
}


var Weapon = function(type, rare, name, atk, spd, range, other, buff, atkfrm, atknum, atkwait){
	this.type = type; //武器種
	this.rare = Number(rare); //☆
	this.name = name; //名前
	this.atk = Number(atk); //攻撃

	//武器バフ
	this.spd = Number(spd) || 0; //攻撃速度上昇(atkfrmを何％早くするか)
	this.range = Number(range) || 0; //範囲
	this.buff = new Buff(buff);
	this.buffPrint = buff;

	this.atkfrm  = atkfrm || buki_base[type][4][0] //攻撃速度（攻撃フレーム数)
	this.atkwait = atkwait || buki_base[type][4][1]; //攻撃後の隙

	this.atknum = atknum || 1; //1回の攻撃時に何回攻撃するか

	this.other = other || ""; //その他補足情報
};


var weapons = {
"刀": [
	//☆　攻撃　攻撃速度　範囲
new Weapon("刀", "7", "なし", "0", "0", "0"),
new Weapon("刀", "1", "脇差", "5", "30", "0"),
new Weapon("刀", "1", "兜割", "12", "20", "0"),
new Weapon("刀", "1", "太刀", "14", "0", "5"),
new Weapon("刀", "1", "打刀", "17", "0", "0"),
new Weapon("刀", "2", "鉄砲切り兼光", "20", "20", "0"),
new Weapon("刀", "2", "破魔の太刀", "22", "0", "10"),
new Weapon("刀", "2", "雷切", "31", "10", "0"),
new Weapon("刀", "2", "瓶割刀", "35", "0", "0"),
new Weapon("刀", "3", "清正の邪刀", "24", "0", "0", "敵の移動速度を少し下げる"),
new Weapon("刀", "3", "政宗の竜刀", "25", "20", "0", "足止め数+1 攻撃対象-1", {para_f:-1}),
new Weapon("刀", "3", "虎徹", "30", "30", "0"),
new Weapon("刀", "3", "フルンティング", "37", "0", "0", "与ダメージの2%耐久が回復"),
new Weapon("刀", "3", "長巻", "42", "0", "15"),
new Weapon("刀", "3", "古代刀", "45", "10", "0"),
new Weapon("刀", "3", "蛇刀", "48", "0", "10"),
new Weapon("刀", "3", "姫切", "52", "0", "0"),
new Weapon("刀", "3", "フラガラッハ", "54", "0", "50", "敵1体に攻撃", {para_f:-1}),
new Weapon("刀", "4", "ちゅんちゅん丸", "16", "0", "-10", "隙-25%", {wait_p:25}),
new Weapon("刀", "4", "亘理来国光", "30", "0", "0", "防御+30", {def_f:30}),
new Weapon("刀", "4", "真・政宗の竜刀", "32", "20", "0", "足止め数+1 攻撃対象-1", {para_f:-1}),
new Weapon("刀", "4", "真・清正の邪刀", "35", "0", "0", "敵の移動速度を少し下げる"),
new Weapon("刀", "4", "桜花爛漫刀", "43", "20", "10"),
new Weapon("刀", "4", "妖刀村正", "48", "20", "0"),
new Weapon("刀", "4", "魔剣フルンティング", "48", "0", "0", "与ダメージの2%耐久が回復"),
new Weapon("刀", "4", "千代金丸", "50", "0", "0", "回復+3", {rec_f:3}),
new Weapon("刀", "4", "同田貫", "52", "0", "10"),
new Weapon("刀", "4", "蜂須賀虎徹", "56", "0", "0", "計略再使用-3秒"),
new Weapon("刀", "4", "さやかの剣", "56", "0", "0", "敵1体に2連続攻撃 攻撃対象-1", {para_f:-1}, 37, 2),
new Weapon("刀", "4", "明鏡止水", "57", "0", "5"),
new Weapon("刀", "4", "童子切安綱", "59", "0", "0", "防御+10", {def_f:10}),
new Weapon("刀", "4", "飛天鳳凰丸", "61", "0", "0", "耐久+100", {hp_f:100}),
new Weapon("刀", "4", "鬼丸国綱", "66", "0", "0"),
new Weapon("刀", "4", "聖剣ｴｸｽｶﾘﾊﾞｰ", "71", "0", "0", "防御無視5%", {dis_p:5}),
new Weapon("刀", "4", "魔剣フラガラッハ", "72", "0", "50", "敵1体に攻撃", {para_f:-1}),
new Weapon("刀", "5", "妖刀村正[改]", "54", "25", "0", "攻撃時敵の防御を8%低下", {d_def_p:8}),
new Weapon("刀", "5", "明鏡止水[改]", "63", "0", "10", "隙短縮5%", {wait_p:5}),
new Weapon("刀", "5", "童子切安綱[改]", "65", "0", "0", "範囲内の城娘の防御+15", {def_f:15}),
new Weapon("刀", "5", "飛天鳳凰丸[改]", "67", "0", "0", "耐久+150 回復+5", {hp_f:150, rec_f:5}),
new Weapon("刀", "5", "鬼丸国綱[改]", "72", "0", "0", "範囲内の妖怪の被ダメージが10%増加", {yokai_d_dmg_p:10}),
new Weapon("刀", "5", "桜花爛漫刀[改]", "49", "25", "15"),


	],
"槍": [
new Weapon("槍", "7", "なし", "0", "0", "0"),
new Weapon("槍", "1",	"竹槍",	"5",	"20",	"0"),
new Weapon("槍", "1",	"薙刀",	"8",	"0",	"0",	"防御+5", {def_f:5}),
new Weapon("槍", "1",	"長柄鎌",	"10",	"0",	"10"),
new Weapon("槍", "1",	"直槍",	"13",	"0",	"0"),
new Weapon("槍", "2",	"裂空の真槍",	"14",	"20",	"0"),
new Weapon("槍", "2",	"陣中槍",	"26",	"0",	"0"),
new Weapon("槍", "3",	"名槍ロン",	"13",	"0",	"0",	"耐久+400", {hp_f:400}),
new Weapon("槍", "3",	"幸村の朱槍",	"14",	"0",	"25",	"攻撃速度低下", {}, 40), //仮
new Weapon("槍", "3",	"双龍槍",	"26",	"20",	"0"),
new Weapon("槍", "3",	"片鎌槍",	"33",	"10",	"0"),
new Weapon("槍", "3",	"極大長槍",	"36",	"0",	"5"),
new Weapon("槍", "3",	"岩融",	"38",	"0",	"0"),
new Weapon("槍", "3",	"利家の巨槍",	"48",	"0",	"0",	"攻撃速度低下", {}, 40),
new Weapon("槍", "4",	"聖槍ロンゴミニアド",	"20",	"0",	"0",	"耐久+500", {hp_f:500}),
new Weapon("槍", "4",	"両刃櫃槍",	"20",	"0",	"0",	"敵1体に2連続攻撃 攻撃速度低下", {}, 57, 2),
new Weapon("槍", "4",	"真・幸村の朱槍",	"21",	"0",	"25",	"攻撃速度低下", {}, 40), //仮
new Weapon("槍", "4",	"門松寿槍",	"22",	"0",	"0",	"防御+25", {def_f:25}),
new Weapon("槍", "4",	"桜花爛漫槍",	"30",	"20",	"10"),
new Weapon("槍", "4",	"ニライカナイ",	"25",	"0",	"0",	"敵の移動速度を少し下げる 敵1体に2連続攻撃 攻撃速度低下", {}, 57, 2),
new Weapon("槍", "4",	"とんぼきり",	"31",	"0",	"20"),
new Weapon("槍", "4",	"蜻蛉切",	"35",	"20",	"0"),
new Weapon("槍", "4",	"御手杵",	"43",	"0",	"5"),
new Weapon("槍", "4",	"夜叉彦槍",	"44",	"0",	"0",	"計略再使用-3秒"),
new Weapon("槍", "4",	"人間無骨",	"45",	"0",	"0",	"回復+3", {rec_f:3}),
new Weapon("槍", "4",	"日本号",	"47",	"0",	"0",	"防御+5", {def_f:5}),
new Weapon("槍", "4",	"杏子の槍",	"47",	"0",	"0",	"	槍の貫通距離が1.2倍"),
new Weapon("槍", "4",	"大千鳥十文字槍",	"49",	"0",	"0",	"耐久+50", {hp_f:50}),
new Weapon("槍", "4",	"山姥の槍",	"51",	"0",	"0"),
new Weapon("槍", "4",	"真・利家の巨槍",	"58",	"0",	"0",	"攻撃速度低下", {}, 40), //仮
new Weapon("槍", "5",	"夜叉彦大天衝槍",	"48",	"0",	"15",	"計略再使用-5秒"),
new Weapon("槍", "5",	"桜花爛漫槍[改]",	"36",	"25",	"15"),
new Weapon("槍", "5",	"蜻蛉切[改]",	"41",	"25",	"0",	"攻撃後の隙が5%短縮", {dis_p:5}),
new Weapon("槍", "5",	"御手杵[改]",	"49",	"0",	"10",	"槍の貫通距離が1.1倍", {}),
new Weapon("槍", "5",	"人間無骨[改]",	"51",	"0",	"0",	"回復+8 敵の防御を5%無視", {rec_f:8, dis_p:5}),
new Weapon("槍", "5",	"日本号[改]",	"53",	"0",	"0",	"防御+10 被ダメージを2%軽減", {def_f:10}),
new Weapon("槍", "5",	"大千鳥十文字槍[改]",	"55",	"0",	"0",	"耐久+100 範囲内の妖怪の被ダメージが8%上昇", {hp_f:100, yokai_d_dmg_p:8}),
new Weapon("槍", "5",	"山姥の槍[改]",	"57",	"0",	"0",	"敵の防御を10%低下", {d_def_p:10}),
new Weapon("槍", "5",	"真・利家の巨槍[改]",	"64",	"0",	"0",	"攻撃+5% 攻撃動作が少し低速化", {atk_p:5}, 28), //仮

	],
"槌": [
new Weapon("槌", "7",	"なし", "0", "0", "0"),
new Weapon("槌", "1",	"木槌",	"6",	"30",	"0"),
new Weapon("槌", "1",	"棍棒",	"28",	"0",	"0"),
new Weapon("槌", "2",	"金棒",	"27",	"0",	"10"),
new Weapon("槌", "2",	"戦鎚",	"41",	"0",	"0"),
new Weapon("槌", "3",	"神木の槌",	"54",	"0",	"0"),
new Weapon("槌", "3",	"義重の重槌",	"59",	"0",	"0", "直撃ボーナス+50% 範囲攻撃の範囲が半減", {bomatk_p:50}),
new Weapon("槌", "3",	"義弘の暴槌",	"73",	"0",	"0",	"攻撃速度低下", {}, 40), //仮
new Weapon("槌", "4",	"わたぬきやくも",	"3",	"0",	"0"),
new Weapon("槌", "4",	"桜花爛漫槌",	"36",	"20",	"10"),
new Weapon("槌", "4",	"打ち出の小槌",	"44",	"30",	"0"),
new Weapon("槌", "4",	"大垣清流槌",	"49",	"0",	"20"),
new Weapon("槌", "4",	"軍配形天守槌",	"54",	"20",	"0"),
new Weapon("槌", "4",	"鬼の金棒",	"60",	"0",	"10"),
new Weapon("槌", "4",	"怪薬の槌",	"55",	"0",	"0", "与ダメージの2%耐久が回復", {yrec_p:2}),
new Weapon("槌", "4",	"魔滅の金棒",	"60",	"0",	"0",	"敵をすこし後退させる"),
new Weapon("槌", "4",	"源翁鎚",	"74",	"0",	"0"),
new Weapon("槌", "4",	"真・義重の重槌",	"81",	"0",	"0", "直撃ボーナス+50% 範囲攻撃の範囲が半減", {bomatk_p:50}),
new Weapon("槌", "4",	"真・義弘の暴槌",	"100",	"0",	"0",	"攻撃速度低下", {}, 52),//33377769
new Weapon("槌", "5",	"桜花爛漫槌[改]",	"42",	"25",	"15",	""),
new Weapon("槌", "5",	"打ち出の小槌[改]",	"50",	"35",	"0",	"攻撃後の隙が5%短縮", {wait_p:5}),
new Weapon("槌", "5",	"鬼の金棒[改]",	"66",	"0",	"15",	"範囲攻撃の範囲がやや拡大"),
new Weapon("槌", "5",	"源翁鎚[改]",	"80",	"0",	"0",	"範囲内の妖怪の被ダメージが10%上昇", {yokai_d_dmg_p:10}),
new Weapon("槌", "5",	"真・義重の重槌[改]",	"81",	"0",	"0", "直撃ボーナス+60% 範囲攻撃の範囲が半減", {bomatk_p:60}),
new Weapon("槌", "5",	"真・義弘の暴槌[改]",	"121",	"0",	"0",	"攻撃速度が少し低下", {}, 29),
	],

"盾": [
new Weapon("盾", "7",	"なし", "0", "0", "0"),
new Weapon("盾", "1",	"ブロンズシールド",	"2",	"0",	"0",	"防御+15", {def_f:15}),
new Weapon("盾", "1",	"ウッドシールド",	"3",	"0",	"0",	"防御+12", {def_f:12}),
new Weapon("盾", "1",	"バックラー",	"5",	"0",	"0",	"防御+10", {def_f:10}),
new Weapon("盾", "2",	"タワーシールド",	"8",	"0",	"0",	"防御+29", {def_f:29}),
new Weapon("盾", "2",	"カイトシールド",	"10",	"0",	"0",	"防御+27", {def_f:27}),
new Weapon("盾", "2",	"ラウンドシールド",	"13",	"0",	"0",	"防御+23", {def_f:23}),
new Weapon("盾", "3",	"ｼｭﾃﾌｧﾝの闘盾",	"10",	"0",	"20",	"防御+33", {def_f:33}),
new Weapon("盾", "3",	"プリトウェン",	"15",	"0",	"0",	"防御+44", {def_f:44}),
new Weapon("盾", "3",	"アキレウスの盾",	"20",	"0",	"0",	"防御+37", {def_f:37}),
new Weapon("盾", "3",	"氏康の獅盾",	"44",	"0",	"0",	"敵の防御を10%無視 防御+29", {def_f:29, dis_p:10}, 42),
new Weapon("盾", "4",	"ほむらの盾",	"13",	"0",	"100", "敵1体に攻撃 防御+32 足止め数-2", {def_f:32, para_f:-1}),
new Weapon("盾", "4",	"桜花爛漫盾",	"14",	"20",	"10", "防御+41", {def_f:41}),
new Weapon("盾", "4",	"真･ｼｭﾃﾌｧﾝの闘盾",	"15",	"0",	"20",	"防御+43", {def_f:43}),
new Weapon("盾", "4",	"ダクネスの剣",	"18",	"0",	"0",	"敵3体を足止め 防御+22", {def_f:22}),
new Weapon("盾", "4",	"ちょこしぃるど",	"21",	"0",	"0",	"回復+3 防御+30", {def_f:30,rec_f:3}),
new Weapon("盾", "4",	"アイアースの盾",	"23",	"0",	"0",	"耐久+300 防御+48", {def_f:48,hp_f:300}),
new Weapon("盾", "4",	"イージスの盾",	"25",	"0",	"0",	"防御+55", {def_f:55}),
new Weapon("盾", "4",	"スヴェル",	"30",	"0",	"0",	"防御+50", {def_f:50}),
new Weapon("盾", "4",	"ﾎｰﾘｰﾅｲﾄｼｰﾙﾄﾞ",	"33",	"0",	"10",	"防御+37 回復+3", {def_f:37,rec_f:3}),
new Weapon("盾", "4",	"白薔薇の盾",	"35",	"0",	"0",	"防御+35", {def_f:35}),
new Weapon("盾", "4",	"パンプキンシールド",	"40",	"0",	"15",	"防御+30", {def_f:30}),
new Weapon("盾", "4",	"幻想聖盾",	"52",	"0",	"0",	"防御+36", {def_f:36}),
new Weapon("盾", "4",	"真・氏康の獅盾",	"59",	"0",	"0",	"敵の防御を10%無視 防御+37", {def_f:37, dis_p:10}, 42),
new Weapon("盾", "5",	"桜花爛漫盾[改]",	"20",	"25",	"15",	"防御+46", {def_f:46}),
new Weapon("盾", "5",	"真･ｼｭﾃﾌｧﾝの闘盾[改]",	"21",	"0",	"25",	"防御+48", {def_f:48}),
new Weapon("盾", "5",	"アイアースの盾[改]",	"29",	"0",	"0",	"耐久+450 防御+53 敵撃破時に耐久が最大の2%回復", {hp_f:450, def_f:53}),
new Weapon("盾", "5",	"イージスの盾[改]",	"31",	"0",	"0",	"防御+60 敵の攻撃範囲を20%低下", {def_f:60}),
new Weapon("盾", "5",	"スヴェル[改]",	"36",	"0",	"0",	"防御+55 敵の攻撃の5%をダメージとして反射", {def_f:55}),

	],

"拳": [
	],

"投剣": [
	//☆　攻撃　攻撃速度　範囲
new Weapon("投剣",	"7",	"なし", "0", "0", "0", "", {para_f:2}),
new	Weapon("投剣",	"1",	"手裏剣",	"11",	"0",	"0",	"範囲内の敵6体に攻撃", {para_f:4}),
new	Weapon("投剣",	"1",	"スローイングナイフ",	"21",	"0",	"0",	"範囲内の敵3体に攻撃 飛行型の敵に対して攻撃が1.5倍", {para_f:1, fly_atk_p:50}),
new	Weapon("投剣",	"1",	"苦無",	"26",	"0",	"0",	"範囲内の敵4体に攻撃", {para_f:2}),
new	Weapon("投剣",	"1",	"円戦輪",	"38",	"0",	"25",	"範囲内の敵2体に攻撃", {}),
new	Weapon("投剣",	"2",	"四方手裏剣",	"19",	"0",	"0",	"範囲内の敵6体に攻撃", {para_f:4}),//TODO:攻撃値は仮
new	Weapon("投剣",	"2",	"ブーメランダガー",	"27",	"0",	"0",	"範囲内の敵3体に攻撃 飛行型の敵に対して攻撃が1.5倍", {para_f:1, fly_atk_p:50}),
new	Weapon("投剣",	"2",	"忍の苦無",	"34",	"0",	"0",	"範囲内の敵4体に攻撃", {para_f:2}),
new	Weapon("投剣",	"2",	"双刃戦輪",	"51",	"0",	"25",	"範囲内の敵2体に攻撃", {}),
new	Weapon("投剣",	"3",	"八方手裏剣",	"28",	"0",	"0",	"範囲内の敵6体に攻撃 攻撃速度が少し上昇", {para_f:4}),
new	Weapon("投剣",	"3",	"ウォシュレ",	"34",	"0",	"0",	"範囲内の敵3体に攻撃 飛行型の敵に対して攻撃が1.5倍", {para_f:1, fly_atk_p:50}),
new	Weapon("投剣",	"3",	"十字苦無",	"42",	"0",	"0",	"範囲内の敵4体に攻撃", {para_f:2}),
new	Weapon("投剣",	"3",	"四方戦輪",	"63",	"0",	"30",	"範囲内の敵2体に攻撃", {}),
new	Weapon("投剣",	"4",	"真・元親の荒刃",	"15",	"0",	"0",	"範囲内の敵3体に2連続攻撃 敵の防御を5%無視", {para_f:1, dis_p:5}, 47, 2),
new	Weapon("投剣",	"4",	"桜花爛漫手裏剣",	"23",	"20",	"10",	"範囲内の敵6体に攻撃", {para_f:4}),
new	Weapon("投剣",	"4",	"桜花爛漫短剣",	"25",	"20",	"10",	"範囲内の敵3体に攻撃 飛行型の敵に対して攻撃が1.5倍", {para_f:1, fly_atk_p:50}),
new	Weapon("投剣",	"4",	"風魔苦無",	"30",	"0",	"0",	"範囲内の敵4体に攻撃 敵の移動速度を低下(敵の移動速度を少し下げる)", {para_f:2}),
new	Weapon("投剣",	"4",	"月光の短剣",	"30",	"20",	"0",	"範囲内の敵3体に攻撃 飛行型の敵に対して攻撃が1.5倍", {para_f:1, fly_atk_p:50}),
new	Weapon("投剣",	"4",	"桜花爛漫苦無",	"32",	"20",	"10",	"範囲内の敵4体に攻撃", {para_f:2}),
new	Weapon("投剣",	"4",	"ﾀﾞﾏｽｷﾅｰﾄﾞﾅｲﾌ",	"44",	"0",	"0",	"範囲内の敵3体に攻撃 飛行型の敵に対して攻撃が1.5倍", {para_f:1, fly_atk_p:50}),
new	Weapon("投剣",	"4",	"夜叉の苦無",	"55",	"0",	"0",	"範囲内の敵4体に攻撃", {para_f:2}),
new	Weapon("投剣",	"4",	"桜花爛漫戦輪",	"58",	"20",	"30",	"範囲内の敵2体に攻撃", {}),
new	Weapon("投剣",	"4",	"白鏡の戦輪",	"84",	"0",	"40",	"範囲内の敵2体に攻撃", {}),
new	Weapon("投剣",	"5",	"桜花爛漫手裏剣[改]",	"29",	"25",	"15",	"範囲内の敵7体に攻撃", {para_f:5}),
new	Weapon("投剣",	"5",	"桜花爛漫短剣[改]",	"31",	"25",	"15",	"範囲内の敵3体に攻撃 飛行型の敵に対して攻撃が1.5倍 敵の防御を3%無視", {para_f:1, fly_atk_p:50, dis_p:3}),
new	Weapon("投剣",	"5",	"風魔苦無[改]",	"36",	"5",	"0",	"範囲内の敵4体に攻撃 敵の移動速度を低下", {para_f:2}),
new	Weapon("投剣",	"5",	"月光の短剣[改]",	"36",	"25",	"0",	"範囲内の敵3体に攻撃 飛行型の敵に対して攻撃が1.5倍 敵の防御を3%無視 攻撃後の隙が5%短縮", {para_f:1, fly_atk_p:50, dis_p:3, wait_p:5}),
new	Weapon("投剣",	"5",	"桜花爛漫苦無[改]",	"38",	"30",	"15",	"範囲内の敵4体に攻撃", {para_f:2}),
new	Weapon("投剣",	"5",	"ﾀﾞﾏｽｷﾅｰﾄﾞﾅｲﾌ[改]",	"50",	"0",	"0",	"範囲内の敵3体に攻撃 飛行型の敵に対して攻撃が1.5倍 敵の攻撃を25低下 敵の防御を3%無視", {para_f:1, fly_atk_p:50, d_atk_f:25, dis_p:3}),
new	Weapon("投剣",	"5",	"夜叉の苦無[改]",	"61",	"5",	"0",	"範囲内の敵4体に攻撃 敵の攻撃を10%低下", {para_f:2, d_atk_p:10}),
new	Weapon("投剣",	"5",	"桜花爛漫戦輪[改]",	"64",	"25",	"40",	"範囲内の敵2体に攻撃", {}),
new	Weapon("投剣",	"5",	"白鏡の戦輪[改]",	"90",	"0",	"50",	"範囲内の敵2体に攻撃 敵の防御を25低下", {d_def_f:25})
	],

"弓": [
new Weapon("弓", "7",	"なし", "0", "0", "0"),
new Weapon("弓", "1", "鏑矢", "6", "0", "10"),
new Weapon("弓", "1", "柳葉", "9", "10", "0"),
new Weapon("弓", "1", "破壊の弓", "11", "0", "0"),
new Weapon("弓", "2", "重藤の弓", "14", "20", "0"),
new Weapon("弓", "2", "破魔弓", "15", "0", "10"),
new Weapon("弓", "2", "雷の弓", "20", "10", "0"),
new Weapon("弓", "2", "炎の弓", "23", "0", "0"),
new Weapon("弓", "3", "元就の謀弓", "3", "0", "0", "範囲内の敵三体に攻撃 攻撃速度低下", {para_f:2}, 69),
new Weapon("弓", "3", "昌景の赤弓", "13", "0", "0", "敵1体に2連続攻撃 攻撃速度低下", {}, 48, 2),
new Weapon("弓", "3", "天鹿児弓", "24", "20", "0"),
new Weapon("弓", "3", "光義の弓", "26", "0", "20"),
new Weapon("弓", "3", "殲滅の猛弓", "32", "0", "5"),
new Weapon("弓", "3", "為朝の弓", "34", "0", "0"),
new Weapon("弓", "4", "黄金の渚弓", "10", "0", "0", "範囲内の敵三体に攻撃 攻撃後の隙が増加 敵の防御を15低下", {para_f:2, d_def_f:15}, null, null, 53),
new Weapon("弓", "4", "真・元就の謀弓", "12", "0", "0", "範囲内の敵三体に攻撃 攻撃速度低下", {para_f:2}, 69),
new Weapon("弓", "4", "真・昌景の赤弓", "22", "0", "0", "敵1体に2連続攻撃 攻撃速度低下", {}, 48, 2),
new Weapon("弓", "4", "幽閉の紅弓", "20", "0", "0", "", {dis_p:8}),
new Weapon("弓", "4", "天の羽々矢", "29", "30", "0"),
new Weapon("弓", "4", "桜花爛漫弓", "31", "20", "10"),
new Weapon("弓", "4", "平泉の夏弓", "34", "0", "0", "与ダメージの3%耐久が回復"),
new Weapon("弓", "4", "聚楽の弓", "35", "20", "0"),
new Weapon("弓", "4", "稲穂天弓", "36", "10", "0", "回復+5", {rec_p:5}),
new Weapon("弓", "4", "まどかの弓", "38", "0", "20", "矢の着弾速度高速化"),
new Weapon("弓", "4", "雷上動", "40", "10", "0"),
new Weapon("弓", "4", "弓張月", "43", "0", "10"),
new Weapon("弓", "4", "梓弓", "45", "0", "0"),
new Weapon("弓", "5", "真・元就の謀弓[改]", "18", "0", "0", "範囲内の敵3体に攻撃 計略再使用時間-3秒 攻撃動作が少し低速化", {para_f:2}, 40),
new Weapon("弓", "5", "天の羽々矢[改]", "35", "35", "0", "矢の着弾速度が高速化"),
new Weapon("弓", "5", "桜花爛漫弓[改]", "37", "25", "15"),
new Weapon("弓", "5", "雷上動[改]", "46", "15", "0", "範囲内の妖怪の被ダメージが8%増加", {yokai_d_dmg_p:8}),
new Weapon("弓", "5", "弓張月[改]", "49", "0", "15", "隙短縮5%", {wait_p:5}),
new Weapon("弓", "5", "梓弓[改]", "51", "0", "0", "与ダメージが4%上昇", {dmg_p:4}),


	],
"石弓": [
new Weapon("石弓", "7",	"なし", "0", "0", "0"),
new Weapon("石弓", "1", "木弩", "10", "20", "0"),
new Weapon("石弓", "1", "石弩", "28", "0", "0"),
new Weapon("石弓", "2", "連弩", "18", "0", "0", "範囲内の敵2体に攻撃", {para_f:1}, 42),
new Weapon("石弓", "2", "東方弩", "54", "0", "0"),
new Weapon("石弓", "3", "高虎の忠弩", "35", "0", "0", "敵の移動速度を少し下げる"),
new Weapon("石弓", "3", "舞鶴", "55", "20", "0"),
new Weapon("石弓", "3", "近衛の弩", "72", "0", "20"),
new Weapon("石弓", "3", "正則の剛弩", "84", "0", "0", "攻撃速度低下", {}, 38),
new Weapon("石弓", "4", "わたぬき千狐", "5", "0", "0"),
new Weapon("石弓", "4", "多賀柵弩", "14", "0", "20", "範囲内の敵3体に攻撃 攻撃速度低下", {para_f:2}, 57),
new Weapon("石弓", "4", "無双弩", "27", "0", "0", "範囲内の敵3体に攻撃 攻撃速度低下", {para_f:2}, 57), 
new Weapon("石弓", "4", "王花の弩", "38", "0", "20", "敵の移動速度を少し下げる"),
new Weapon("石弓", "4", "潮見舞鶴", "40", "0", "0", "敵の攻撃速度を下げる"),
new Weapon("石弓", "4", "龍顎連弩", "42", "0", "0", "敵1体に2連続攻撃 攻撃動作が低下", {}, 57, 2),
new Weapon("石弓", "4", "真・高虎の忠弩", "51", "0", "0", "敵の移動速度を少し下げる"),
new Weapon("石弓", "4", "緋鯉の弩", "55", "0", "0", "巨大化の気を5%軽減", {ki_p:5}),
new Weapon("石弓", "4", "桜花爛漫弩", "57", "20", "10"),
new Weapon("石弓", "4", "六花の水弩", "79", "0", "0", "敵を少し後退させる"),
new Weapon("石弓", "4", "龍髭の弩", "83", "0", "20"),
new Weapon("石弓", "4", "床子弩", "96", "0", "0"),
new Weapon("石弓", "4", "真・正則の剛弩", "113", "0", "0", "攻撃速度低下", {}, 38),
new Weapon("石弓", "5", "多賀柵鎮守弩", "15", "0", "20", "範囲内の敵5体に攻撃 攻撃速度低下", {para_f:4}, 77),
new Weapon("石弓", "5", "無双弩[改]", "33", "10", "0", "範囲内の敵3体に攻撃 攻撃速度低下 攻撃速度+10%", {para_f:2}, 57), 
new Weapon("石弓", "5", "桜花爛漫弩[改]", "63", "25", "15"),
new Weapon("石弓", "5", "龍髭の弩[改]", "89", "0", "25", "範囲内の妖怪の被ダメージが8%増加", {yokai_d_dmg_p:8}),
new Weapon("石弓", "5", "床子弩[改]", "102", "0", "0", "隙短縮7%", {wait_p:7}),
new Weapon("石弓", "5", "真・正則の剛弩[改]", "119", "0", "0", "防御+25 攻撃速度が少し低下", {def_f:25}, 27),

	],
"鉄砲": [
new Weapon("鉄砲", "7",	"なし", "0", "0", "0"),
new Weapon("鉄砲", "1", "手銃", "4", "20", "0"),
new Weapon("鉄砲", "1", "鉄砲", "15", "0", "20"),
new Weapon("鉄砲", "1", "木砲", "19", "0", "10"),
new Weapon("鉄砲", "1", "紅蓮の小筒", "25", "0", "0"),
new Weapon("鉄砲", "2", "連装銃", "8", "0", "0", "敵1体に2連続攻撃", {}, 82, 2),
new Weapon("鉄砲", "2", "大筒", "35", "0", "20"),
new Weapon("鉄砲", "3", "氏郷の燕砲", "8", "0", "0", "敵1体に3連続攻撃", {}, 102, 3),
new Weapon("鉄砲", "3", "回転砲", "12", "0", "0", "敵1体に3連続攻撃 敵の移動速度を下げる", {}, 102, 3),
new Weapon("鉄砲", "3", "墨縄", "33", "20", "0"),
new Weapon("鉄砲", "3", "ヴァリス", "40", "0", "0", "敵の防御を8%無視", {dis_p:8}),
new Weapon("鉄砲", "3", "光秀の叛砲", "43", "0", "40", "防御-20", {type:"r", def_f:-20}),
new Weapon("鉄砲", "3", "雷光の中筒", "50", "10", "0"),
new Weapon("鉄砲", "3", "信玄砲", "50", "0", "0", "後退距離若干上昇"),
new Weapon("鉄砲", "3", "氷結の大筒", "54", "0", "20"),
new Weapon("鉄砲", "3", "国友鉄砲", "57", "0", "10"),
new Weapon("鉄砲", "3", "天海の鉄砲", "65", "0", "0"),
new Weapon("鉄砲", "3", "三成の烈砲", "70", "0", "0", "攻撃速度低下", {}, 62),
new Weapon("鉄砲", "4", "真・氏郷の燕砲", "14", "0", "0", "敵1体に3連続攻撃", {}, 102, 3),
new Weapon("鉄砲", "4", "滅・ガトリング砲", "21", "0", "0", "敵1体に3連続攻撃 敵の移動速度を下げる", {}, 102, 3),//仮
new Weapon("鉄砲", "4", "桜花爛漫銃", "52", "20", "10"),
new Weapon("鉄砲", "4", "賀正門松砲", "45", "0", "0", "敵1体に3連続攻撃 敵の移動速度を下げる 攻撃速度が少し低下", {}, 113, 3),
new Weapon("鉄砲", "4", "未来ｶﾞｼﾞｪｯﾄ1号機", "52", "0", "0", "敵の移動速度を一瞬だけ0にする"),
new Weapon("鉄砲", "4", "八咫烏", "58", "20", "0"),
new Weapon("鉄砲", "4", "ヴァリス改", "58", "0", "0", "敵の防御を10%無視", {dis_p:10}),
new Weapon("鉄砲", "4", "白鷺の大筒", "60", "10", "0", "隙を10%短縮 攻撃速度+10%", {wait_p:10}),//測定結果に合うよう速度調整
new Weapon("鉄砲", "4", "萩防楯鉄砲", "62", "0", "0", "防御+30", {def_f:30}),
new Weapon("鉄砲", "4", "真・光秀の叛砲", "65", "0", "40", "防御-20", {type:"r", def_f:-20}),
new Weapon("鉄砲", "4", "三崎の長筒", "67", "0", "0", "範囲内の海洋兜の被ダメージが10%増加", {KAIYO_d_dmg_p:10}),
new Weapon("鉄砲", "4", "ﾏﾐのﾏｽｹｯﾄ銃", "69", "0", "0", "範囲内の妖怪へのダメージが10%増加", {yokai_d_dmg_p:10}),
new Weapon("鉄砲", "4", "水布の涼銃", "71", "10", "0"),
new Weapon("鉄砲", "4", "船形今治砲", "73", "0", "20"),
new Weapon("鉄砲", "4", "雨夜手拍子", "80", "0", "0"),
new Weapon("鉄砲", "4", "真・三成の烈砲", "96", "0", "0", "攻撃速度低下", {}, 62),//仮
new Weapon("鉄砲", "5", "滅・ｶﾞﾄﾘﾝｸﾞ砲[改]", "27", "10", "0", "敵1体に3連続攻撃", {}, 102, 3),
new Weapon("鉄砲", "5", "桜花爛漫銃[改]", "58", "25", "15"),
new Weapon("鉄砲", "5", "八咫烏[改]", "64", "25", "0", "攻撃後の隙が5%短縮", {wait_p:5}),
new Weapon("鉄砲", "5", "雨夜手拍子[改]", "89", "0", "0", "与ダメージが4%上昇", {dmg_p:4}),
new Weapon("鉄砲", "5", "真・三成の烈砲[改]", "102", "0", "0", "標的とその周囲を攻撃 攻撃動作が少し低速化", {}, 52),
	],
"大砲": [
new Weapon("大砲", "7",	"なし", "0", "0", "0"),
new Weapon("大砲", "1", "木製大砲", "7", "20", "0"),
new Weapon("大砲", "1", "設置式大筒", "11", "0", "0"),
new Weapon("大砲", "2", "芝辻砲", "16", "20", "0"),
new Weapon("大砲", "2", "セーカー砲", "18", "0", "20"),
new Weapon("大砲", "2", "国友の大砲", "23", "0", "0"),
new Weapon("大砲", "3", "カルバリン砲", "29", "0", "20"),
new Weapon("大砲", "3", "半加農砲", "37", "0", "0"),
new Weapon("大砲", "3", "兼続の愛砲", "47", "0", "0", "爆風範囲低下"),
new Weapon("大砲", "3", "長政の激砲", "48", "0", "0", "攻撃速度低下", {}, 67),
new Weapon("大砲", "4", "未来ｶﾞｼﾞｪｯﾄ5号機", "18", "0", "0", "敵の攻撃と防御を10%下げる", {d_atk_p:10, d_def_p:10}),
new Weapon("大砲", "4", "桜花爛漫砲", "25", "20", "10", ""),
new Weapon("大砲", "4", "門松平蜘蛛砲", "31", "0", "20", "爆風範囲やや拡大"),
new Weapon("大砲", "4", "車山形大砲-祭-", "33", "20", "0"),
new Weapon("大砲", "4", "古天明平蜘蛛砲", "40", "0", "0", "爆風範囲やや拡大"),
new Weapon("大砲", "4", "加農砲", "40", "0", "20"),
new Weapon("大砲", "4", "国崩し", "45", "10", "0"),
new Weapon("大砲", "4", "散星", "50", "0", "0"),
new Weapon("大砲", "4", "真・兼続の愛砲", "60", "0", "0", "爆風範囲低下"),
new Weapon("大砲", "4", "真・長政の激砲", "65", "0", "0", "攻撃速度低下", {}, 67),
new Weapon("大砲", "5", "桜花爛漫砲[改]", "31", "25", "15"),
new Weapon("大砲", "5", "加農砲[改]", "46", "0", "25", "砲弾の着弾速度が高速化"),
new Weapon("大砲", "5", "国崩し[改]", "51", "15", "0", "与ダメージが2%上昇", {dmg_p:2}),
new Weapon("大砲", "5", "散星[改]", "56", "0", "0", "爆風範囲やや拡大"),
new Weapon("大砲", "5", "真・長政の激砲[改]", "71", "0", "0", "攻撃速度が少し低下", {}, 46),

	],
"歌舞": [
	],
"法術": [
new Weapon("法術", "7",	"なし", "0", "0", "0"),
new Weapon("法術", "1", "錫杖", "6", "0", "20"),
new Weapon("法術", "1", "筆", "12", "0", "0"),
new Weapon("法術", "2", "金銅錫杖", "16", "0", "20"),
new Weapon("法術", "2", "弘法の筆", "24", "0", "0"),
new Weapon("法術", "3", "小十郎の響杖", "22", "20", "0"),
new Weapon("法術", "3", "三蔵法師の杖", "28", "0", "20"),
new Weapon("法術", "3", "閻魔の筆", "36", "0", "0"),
new Weapon("法術", "4", "桜花爛漫の筆", "26", "20", "10"),
//new Weapon("法術", "4", "真・直家の毒扇", "28", "0", "0", "標的の周囲に少し拡散 攻撃動作が低速化"),
new Weapon("法術", "4", "第六天魔王の撹杖", "30", "0", "0", "敵の範囲を少し下げる"),
new Weapon("法術", "4", "真・小十郎の響杖", "31", "20", "0"),
new Weapon("法術", "4", "幽魂番傘", "35", "0", "0", "標的の周囲に0.2倍の防御無視ダメージ"),
new Weapon("法術", "4", "菩薩の杖", "37", "0", "20"),
new Weapon("法術", "4", "道風の筆", "42", "10", "0"),
new Weapon("法術", "4", "閻魔裁定筆", "45", "0", "0", "与ダメージが5％増加 回復が0になる", {dmg_p:5}),
new Weapon("法術", "4", "役小角の杖", "53", "0", "0"),
new Weapon("法術", "4", "第六天魔王の錫杖", "62", "0", "0", "速度低下効果が上昇"),
new Weapon("法術", "5", "道風の筆[改]", "48", "15", "0", "攻撃後の隙が5%短縮", {wait_p:5}),
new Weapon("法術", "5", "菩薩の杖[改]", "43", "0", "25", "敵の攻撃を8%低下", {d_atk_p:8}),
new Weapon("法術", "5", "役小角の杖[改]", "59", "0", "0", "移動速度低下時間が増加"),
new Weapon("法術", "5", "桜花爛漫の筆[改]", "32", "25", "15")

	],
"鈴": [
	],
"杖": [
	],
"祓串": [
	]
};


var weaponTable = {}; //武器名→武器オブジェクト
for(var wType in weapons) {
	weapons[wType].forEach(function(wea) {
		weaponTable[wea.name] = wea;
	});
}


var FWeapon = function(type, rare, name, musuname, atk, spd, range, other){
	this.type = type; //武器種
	this.rare = Number(rare); //☆
	this.name = name; //武器名前
	this.musuname = musuname; //城娘名前

	this.atk = Number(atk); //攻撃
	this.spd = Number(spd); //攻撃速度上昇
	this.range = Number(range); //範囲

	this.buff = new Buff();
	this.buffPrint = {};

	this.atkfrm  = buki_base[type][4][0] //攻撃速度（攻撃フレーム数)
	this.atkwait = buki_base[type][4][1]; //攻撃後の隙

	this.atknum = (type == "拳")?3:1; //1回の攻撃時に何回攻撃するか

	this.other = other || ""; //その他補足情報
	this.isFixed = true;
};


//固定装備武器
var fixed_weapon = {
"刀": [
],

"拳": [
new FWeapon("拳",	"4",	"玄武",	"邯鄲",		"25", "0", "0"),
new FWeapon("拳",	"4",	"青龍",	"平遥古城",	"30", "0", "0"),
new FWeapon("拳",	"4",	"青龍",	"麗江古城",	"30", "0", "0"),
new FWeapon("拳",	"4",	"手甲",	"今帰仁城",	"30", "0", "0"),
new FWeapon("拳",	"4",	"海割拳",	"甘崎城",	"30", "0", "0"),
new FWeapon("拳",	"4",	"破砕拳",	"中城城",	"30", "0", "0"),
new FWeapon("拳",	"4",	"白虎",	"長安城",	"35", "0", "0"),
new FWeapon("拳",	"4",	"青龍",	"洛陽城",	"35", "0", "0"),
new FWeapon("拳",	"4",	"天武拳",	"成都城",	"45", "0", "0"),
new FWeapon("拳",	"4",	"黄龍",	"紫禁城",	"45", "0", "0"),
new FWeapon("拳",	"4",	"旋風拳",	"琉球御城",	"45", "0", "0")
],



"歌舞": [
new FWeapon("歌舞",	"4",	"扇",			"窪田城",		"5", "0", "0"),
new FWeapon("歌舞",	"4",	"扇改",			"久保田城",		"11", "0", "0"),
new FWeapon("歌舞",	"4",	"スマイルボイス","尾山御坊",		"13", "0", "0"),
new FWeapon("歌舞",	"4",	"衝波扇",		"鶴ヶ岡城",		"14", "0", "0"),
new FWeapon("歌舞",	"4",	"スイートボイス","山科本願寺",	"14", "0", "0"),
new FWeapon("歌舞",	"4",	"鬼の団扇",		"鬼ノ城",		"18", "0", "0"),
new FWeapon("歌舞",	"4",	"ｷｭｰﾄﾎﾞｲｽ",		"伊勢長島城",		"18", "0", "0"),
new FWeapon("歌舞",	"4",	"鮮緑の扇",	"近江八幡城",		"22", "0", "0"),
new FWeapon("歌舞",	"4",	"慈悲のﾏｲｸ",	"長谷堂城",		"22", "0", "0"),
new FWeapon("歌舞",	"4",	"ペルケオマイク",	"ハイデルベルク城",	"22", "0", "0"),
new FWeapon("歌舞",	"4",	"聖夜のリュート",	"[聖夜]エステンセ城",	"22", "0", "0"),
new FWeapon("歌舞",	"4",	"ハッピーボイス","石山御坊",		"25", "0", "0"),
new FWeapon("歌舞",	"4",	"ｺﾞｰﾙﾄﾞﾏｲｸ",	"水府城",		"25", "0", "0"),
new FWeapon("歌舞",	"4",	"舞扇",			"勝竜寺城",		"25", "0", "0"),
new FWeapon("歌舞",	"4",	"ｴﾚｶﾞﾝﾄﾎﾞｲｽ",		"カゼルタ宮殿",	"25", "0", "0"),
new FWeapon("歌舞",	"4",	"リュート",		"エステンセ城",	"25", "0", "0"),
new FWeapon("歌舞",	"4",	"番傘",		"立花山城",	"25", "0", "0"),
new FWeapon("歌舞",	"5",	"ﾐﾗｸﾙﾗﾌﾞﾘｰﾎﾞｲｽ","大坂城",		"45", "0", "0"),
new FWeapon("歌舞",	"4",	"ｵﾍﾞﾘｽｸﾀｸﾄ",	"ｼｪｰﾝﾌﾞﾙﾝ宮殿",	"35", "0", "0"),
new FWeapon("歌舞",	"4",	"ﾎｰﾘｰﾎﾞｲｽ",		"ﾓﾝ･ｻﾝ=ﾐｯｼｪﾙ",	"35", "0", "0"),
new FWeapon("歌舞",	"4",	"ｾｲｸﾘｯﾄﾞﾎﾞｲｽ",		"[聖夜]ﾓﾝ･ｻﾝ=ﾐｯｼｪﾙ",	"35", "0", "0"),
new FWeapon("歌舞",	"4",	"ｽﾌﾟﾗｯｼｭﾎﾞｲｽ",		"[夏]ｼｪｰﾝﾌﾞﾙﾝ宮殿",	"35", "0", "0"),
new FWeapon("歌舞",	"4",	"ﾆｭｰｲﾔｰﾎﾞｲｽ",		"[正月]大坂城",	"35", "0", "0"),
new FWeapon("歌舞",	"4",	"ｺﾞｰﾙﾃﾞﾝﾎﾞｲｽ",		"肥前名護屋城",	"35", "0", "0"),
],
"鈴": [
new FWeapon("鈴",	"4",	"浮城の鈴",		"高島城",			"20", "0", "0"),
new FWeapon("鈴",	"4",	"真鍮の鈴",		"浜田城",			"20", "0", "0"),
new FWeapon("鈴",	"4",	"舞鶴の鈴",		"天童城",			"20", "0", "0"),
new FWeapon("鈴",	"4",	"ゴールドベル",	"フレデリクスボー城",			"20", "0", "0"),
new FWeapon("鈴",	"4",	"城山の梵鐘",	"延岡城",			"20", "0", "0"),
new FWeapon("鈴",	"4",	"シルバーベル",	"アンボワーズ城",	"28", "0", "0"),
new FWeapon("鈴",	"4",	"祝福のベル",	"[花嫁衣装]ｱﾝﾎﾞﾜｰｽﾞ城",	"28", "0", "0"),
new FWeapon("鈴",	"4",	"海辺の風鈴",	"[夏]指月伏見城",	"28", "0", "0"),
new FWeapon("鈴",	"4",	"太平の鈴",		"新田金山城",		"28", "0", "0"),
new FWeapon("鈴",	"4",	"シルバーベル",	"城塞都市ﾙｸｾﾝﾌﾞﾙｸ",	"28", "0", "0"),
new FWeapon("鈴",	"4",	"グレート・ベル","ｳｪｽﾄﾐﾝｽﾀｰ宮殿",	"28", "0", "0"),
new FWeapon("鈴",	"4",	"天神の鈴",		"川越城",			"28", "0", "0"),
new FWeapon("鈴",	"4",	"金の鈴",		"指月伏見城",		"35", "0", "0"),
new FWeapon("鈴",	"4",	"夜桜の鈴",		"烏城",				"40", "0", "0"),
new FWeapon("鈴",	"4",	"寧楽の鈴",		"平城京",			"40", "0", "0")
],

"杖": [
new FWeapon("杖",	"4",	"銀の杖",			"ｱｲﾘｰﾝ･ﾄﾞﾅﾝ城",		"25", "0", "0"),
new FWeapon("杖",	"4",	"深緑の杖",			"スピシュ城",		"30", "0", "0"),
new FWeapon("杖",	"4",	"宝石の杖",			"ﾎｰｴﾝﾂｫﾚﾙﾝ城",		"30", "0", "0"),
new FWeapon("杖",	"4",	"星時計の杖",		"ｽﾌｫﾙﾂｪｽｺ城",		"30", "0", "0"),
new FWeapon("杖",	"4",	"荊棘の杖",			"ユッセ城",			"35", "0", "0"),
new FWeapon("杖",	"4",	"クリスタルの杖",	"シュノンソー城",	"35", "0", "0"),
new FWeapon("杖",	"4",	"クリスタルの杖",	"ﾎｰｴﾝｻﾞﾙﾂﾌﾞﾙｸ城",	"35", "0", "0"),
new FWeapon("杖",	"4",	"荊棘の箒",			"[ﾊﾛｳｨﾝ]ユッセ城",	"35", "0", "0"),
new FWeapon("杖",	"4",	"クリスタルの杖",	"ｾｺﾞﾋﾞｱのｱﾙｶｻﾙ",	"35", "0", "0"),
new FWeapon("杖",	"4",	"荊棘の杖",			"ペーナ宮殿",		"35", "0", "0"),
new FWeapon("杖",	"4",	"クリスタルの杖",	"ﾘﾝﾄﾞｽ･ｱｸﾛﾎﾟﾘｽ",	"35", "0", "0"),
new FWeapon("杖",	"4",	"クリスタルの杖",	"ネスヴィジ城",		"35", "0", "0"),
new FWeapon("杖",	"4",	"クリスタルの杖",	"城塞都市アッシジ",		"35", "0", "0"),
new FWeapon("杖",	"4",	"愛の杖",			"スワローズ・ネスト",	"35", "0", "0"),
new FWeapon("杖",	"4",	"女神の杖",			"プラハ城",			"45", "0", "0"),
new FWeapon("杖",	"4",	"凶眼の魔杖",		"ウチヒサル城",		"45", "0", "0"),
new FWeapon("杖",	"4",	"水鏡の杖",			"ｳﾞｪﾙｻｲﾕ宮殿",		"45", "0", "0"),
new FWeapon("杖",	"4",	"蒼湖の杖",			"オラヴィ城",		"45", "0", "0"),
new FWeapon("杖",	"4",	"回輪の杖",			"城塞都市ﾆｭｰﾙﾝﾍﾞﾙｸ",	"45", "0", "0")

],

"祓串": [
new FWeapon("祓串",	"4",	"金扇馬印幣",		"久能山城",		"25", "0", "0"),
new FWeapon("祓串",	"4",	"糸桜幣",			"室町第",		"25", "0", "0"),
new FWeapon("祓串",	"4",	"筑紫大宰幣",		"大宰府",		"35", "0", "0"),
new FWeapon("祓串",	"4",	"神明幣",			"白石城",		"20", "0", "0"),
new FWeapon("祓串",	"4",	"下一宮幣",			"阿波一宮城",	"20", "0", "0"),
]

};

var mistakeNameBuki = {
	"桜花爛漫筆": "桜花爛漫の筆",
	"聖剣エクスカリバー": "聖剣ｴｸｽｶﾘﾊﾞｰ"
};

//@param 城娘
//@param 武器名
function getWeapon(siromusu, wea_name){
	//固定武器から検索
	var fwea = getFWeapon(siromusu);
	if(fwea){ return fwea; } 

	//装備武器から検索
	var wea = $.grep(weapons[siromusu.buki], function(w){ //選択中の武器
			return w.name == wea_name;
		});
	
	if(wea[0]) {
		return wea[0];
	} else {
		//過去に間違った名前でセーブデータに登録されているのを救済
		if(mistakeNameBuki[wea_name]) {
			wea_name = mistakeNameBuki[wea_name];
			return $.grep(weapons[siromusu.buki], function(w){ //選択中の武器
				return w.name == wea_name;
			})[0];
		}

		if(weapons[siromusu.buki]) {
			return weapons[siromusu.buki][0];
		}
		return;
	}
}

function getFWeapon(siromusu)
{
	if(!fixed_weapon[siromusu.buki]){ //武器種がない
		return null;
	}

	return fixed_weapon[siromusu.buki].find(function(fw) {
			return fw.musuname == siromusu.name.replace("改壱", "");
	});
}

